// // @ 만들고자 하는 기능을 작성한다.
// // - #123adf 와 같은 색상코드가 랜덤으로 배경과 글씨가 바뀌는 컬러피커

// 키워드 정리 
// 헥사코드, 랜덤, 배경, 글씨 변경 
// 배열, 랜덤메소드, DOM 변경 , DOM 변경 

// 1. 숫자를 랜덤인 헥사코드를 나오게 하는 함수 
//   ㄴ 배열에서 한개의 숫자를 뽑아내는 함수 
//   ㄴ 헥사코드는 6가지 숫자로 이뤄져있음으로 6개의 숫자를 나오게하는 함수 
//   ㄴ # + 숫자를 합치는 함수 
// 2. 클릭했을떄 배경을 변하게 하는 이벤트
// 3. 클릭했을때 텍스트가 바뀌는 이벤트 
// 4. 

// // 0. 필요한 배열이나 객체 변수를 생성한다.
// // // 0 1 2 3 4 5 6 7 8 9 A B C D E F  로 헥사코드는 구성되어있다.
// // 1. 이펙트가 발생할 dom을 담을 변수를 생성한다.
// // 2. 이벤트를 발생시킨다.
// // 3. 기능을 수행할 함수를 작성한다.


